[CommonParserMessages]
BadCondition=Nieprawidłowa składnia wyrażenia warunkowego
BadAssign=Nieprawidłowa składnia instrukcji przypisania
BadInput=Nieprawidłowa składnia instrukcji wejścia
BadOutput=Nieprawidłowa składnia instrukcji wyjścia
BadFunction=Nieprawidłowe wywołanie funkcji
BadFor=Nieprawidłowa składnia lub typ wyrażenia
BadCase=Nieprawidłowa składnia lub typ instrukcji wyboru
BadGeneric=Nieprawidłowa składnia wyrażenia
ExpOk=%s%sWyrażenie poprawne
ExpErr=%s%sBŁĄD: %s
ExpErrMult=Linia %d: %s%sBŁĄD: %s
IntReq=Wymagana wartość typu integer
NoCVar=%sBŁĄD: Brak zmiennej sterującej
BadCVar=%s%sBŁĄD: Niepoprawna zmienna sterująca
NoCExp=%sBŁĄD: Brak wyrażenia warunkowego
NoCaseExp=%sBŁĄD: Brak wyrażenia wyboru
NoInstr=%sOSTRZEŻENIE: Brak instrukcji
NoFCall=%sOSTRZEŻENIE: Brak wywołania funkcji
IncTypes=Niezgodność typów: %s oraz %s
BadFuncParm=Nieprawidłowy typ (%s) argumentu funkcji %s
BadFuncParmU=Nieprawidłowy parametr funkcji %s
BreakErr=Użycie BREAK poza pętlą
ContErr=Użycie CONTINUE poza pętlą
BadConstOp=Niedozwolona operacja na stałej "%s"
BadInOper=Niedozwolona operacja wejścia na zmiennej "%s"
BadOperArg=Nieprawidłowy typ (%s) argumentu operatora "%s"
UnknId=Niezdefiniowany identyfikator "%s"
BadFuncParms=Nieprawidłowa lista parametrów funkcji "%s"
BadCmpr=Nieprawidłowa instrukcja porównania
VarExpct=Oczekiwany identyfikator zmiennej
NoOut=Brak wyrażenia wyjściowego
NotPtrType=Zmienna "%s" nie jest typu wskaźnikowego
BadVarOper=Nieprawidłowa operacja na zmiennej "%s"
BadEnumOper=Nieprawidłowe przypisanie do wartości wyliczeniowej "%s"
NoTbl=Brak zadeklarowanej tablicy
BadArrExp=Nieprawidłowe wyrażenie tablicowe.%s"%s" nie jest typu tablicowego
BadIndx=Nieprawidłowy typ indeksu tablicy (%s)
NotStructType=Zmienna "%s" nie jest typu strukturalnego
NoFieldStruct=Struktura typu "%s" nie definiuje pola "%s"
DupCaseVal=Zduplikowane wyrażenie wyboru
BadReturnVal=Zwracana wartość jest niepoprawna
BadIndxNumber=Nieprawidłowa liczba (%d) indeksów tablicy "%s"%sPrawidłowa liczba: %d
BadPtrArray=Nieprawidłowa operacja wskaźnika na tablicy "%s"
UnkFunc=Nieznana funkcja "%s"
NotConst=Wyrażenie nie jest stałe
SetLenDynArr=Funkcja SetLength jest odpowiednia tylko dla dynamicznych tablic (bez zadeklarowanego rozmiaru) lub zmiennych typu string

[Block]
CaptionTrue=PRAWDA
CaptionFalse=FAŁSZ
CaptionIn=we                    
CaptionOut=wy
CaptionStart=START
CaptionStop=STOP
CaptionFor=dla
CaptionTo=do
CaptionCase=WYBIERZ
CaptionExit=POWRÓT
DefValue=WARTOŚĆ DOMYŚLNA:
WhileTemplate=Dopóki %s1
RepeatUntilTemplate=Powtarzaj aż %s1
IfTemplate=Jeśli %s1
IfElseTemplate=Jeśli %s1
ForDoTemplate=Dla %s1 od %s2 do %s3
CaseOfTemplate=Wybierz %s1 z
InputTemplate=%s1
OutputTemplate=%s1
InstrTemplate=%s1
ReturnTemplate=%s1
TextTemplate=%s1
FolderTemplate=Folder 
FunctionCallTemplate=%s1
ElseLabel=W przeciwnym razie

[Others]
Ok=Ok
Cancel=Anuluj
Confirmation=Potwierdzenie
Error=Błąd
Import=Import
Row=Wiersz
Warning=Ostrzeżenie
AttrInfo=[Atrybut "%s"]: Niewłaściwa wartość - "%s"
ValidationError=Błąd Walidacji
ConvertError=Błąd Konwersji
SyntaxError=Błąd Składni
IOError=Błąd We/Wy
PrintError=Błąd Drukarki
DeclareError=Błąd Deklaracji
CompileError=Błąd Kompilacji
ImportError=Błąd Importowania
BadId=Nieprawidłowy identyfikator.
DupId=Zduplikowany identyfikator.
BadIdD=Nieprawidłowy identyfikator
DupIdD=Zduplikowany identyfikator
DupType=Zduplikowana nazwa typu
DefNtvType=Typ "%s" jest już zdefiniowany jako typ natywny
DefNtvFunc=Funkcja "%s" jest już zdefiniowana jako funkcja natywna
DupField=Zduplikowana nazwa pola
OkIdD=Identyfikator poprawny
BadSize=Nieprawidłowy rozmiar.
BadVarSize=Zmienna "%s" ma nieprawidłowy rozmiar: %s
IncorrectIdKeyword=Nieprawidłowy identyfikator. "%s" - słowo kluczowe języka %s.
BadCVal=Nieprawidłowa wartość stałej.
NoPrinter=Nie znaleziono zainstalowanych drukarek.
ExeFilesFilter=Pliki wykonywalne (*.exe;*.bat;*.cmd)|*.exe; *.bat; *.cmd;
LngFilesFilter=Pliki tłumaczeń (*.lng)|*.lng;
RTFFilesFilter=Dokumenty RTF (*.rtf)|*.rtf;
BMPFilesFilter=Pliki map bitowych (*.bmp)|*.bmp;
JPGFilesFilter=Pliki JPEG (*.jpg)|*.jpg;
PNGFilesFilter=Pliki PNG (*.png)|*.png;
XMLFilesFilter=Dokumenty XML (*.xml)|*.xml;
HTMLFilesFilter=Dokumenty HTML (*.html)|*.html;
TextFilesFilter=Pliki tekstowe (*.txt)|*.txt;
SourceFilesFilter=Pliki %s (*.%s)|*.%s;
ConfirmClose=Czy zapisać zmiany w projekcie %s?
ImportFailed=Procedura importowania nie powiodła się.%s%s
Functions=Funkcje
Function=Funkcja
Procedure=Procedura
Structures=TypyDanych
TagNotFound=Nie znaleziono znacznika dla głównego bloku
ChangeLngAsk=Otwierany projekt został stworzony w języku %s.%sCzy ustawić ten język jako bieżący?
ChangeLngNone=Otwierany projekt został stworzony jako czysty diagram.%s%sCzy przełączyć się na czyste diagramy?
RegErr=Wystąpił błąd podczas zapisywania ustawień aplikacji.
BadImportTag=Brak lub niewłaściwy typ importowanego bloku.
Unknown=nieznany
NoType=brak
Modified=Zmodyfikowany
Default=domyślny
NameTagNotFound=Znacznik <Name> nie istnieje lub jest pusty.
FileError=Błąd podczas wczytywania pliku %s.
ParserError=Błąd parsowania pliku XML #%d w linii %d, kolumna %d: %s
OpenError=Wystąpił błąd podczas otwierania pliku %s:%s%s
SaveReadOnlyFile=Plik %s jest oznaczony jako tylko do odczytu. Nie może być nadpisany.
SaveError=Wystąpił błąd podczas zapisu pliku %s:%s%s
HeaderRequest=Podaj nagłówek:
PrinterError=Podczas drukowania wystąpił błąd:%s%s.
PageCount=Strona %d/%d
ColumnCount=Kolumna %d/%d
RowCount=Wiersz %d/%d
OtherException=%sAktualny projekt zostanie zapisany i zamknięty.
CloseProjectAsk=Zmiana niektórych ustawień wymusza zamknięcie aktualnego projektu.%sCzy chcesz to zrobić?
StatusBarInfo=Lin %d, kol %d
InsertMode=
OverwriteMode=Nadpisywanie
CompilerNotFound=Niezdefiniowane polecenie kompilacji dla języka %s.
CompileFail=Uruchomienie kompilacji nie powiodło się.
RunFail=Uruchomienie programu nie powiodło się.
NoFileToRun=Nie znaleziono pliku %s do wykonania.
VarLocal=lokalna
VarParm=parametr funkcji
HintVar=zmienna %s   %s: %s
HintArray=%s tablica %d-wymiarowa   %s%s: %s
HintArrayExp=Po rozwinięciu typu %s:%s%s tablica %d-wymiarowa   %s%s: %s
HintConst=stała   %s = %s
HintRoutine=procedura/funkcja   %s: %s
HintEnum=wartość wyliczeniowa   %s: %s
chkAddPtrType=Utwórz typ wskaźnika
btnAddField=Dodaj Pole
btnAddValue=Dodaj Wartość
Body=Diagram
lblBodyPage=Zakładka:
mainPage=główny
lblName=Nazwa:
lblType=Typ:
lblSize=Rozmiar:
lblField=Pole:
lblValue=Wartość:
lblRetType=Zwróć typ:
lblLibrary=Biblioteka:
lblParam=Parametr:
lblParamType=Typ:
lblParamDefault=Domyślnie:
lblParamArray=Tablica:
lblParamRef=Ref:
btnAddParm=Dodaj Parametr
edtLibraryHint=Zewnętrzna biblioteka %s zawierająca deklarację
RootNodeText=PROJEKT %s
miFoldTrue=Zwiń
miFoldFalse=Rozwiń
lblErrors=Błędy: %d
lblWarnings=Ostrzeżenia: %d
MainProgram=Program Główny
LocalDeclare=Zmienne Lokalne
Header=Nagłówek
Params=Parametry Formalne
btnAdd=Dodaj
btnImport=Import
btnExport=Eksport
btnChange=Zmień
btnRemove=Usuń
sgVarListCol0=Nazwa:
sgVarListCol1=Typ:
sgVarListCol2=Rozmiar:
sgVarListCol3=Inicjalizacja:
sgVarListCol4=Zewnętrzna:
sgConstListCol0=Nazwa:
sgConstListCol1=Wartość:
sgConstListCol2=Zewnętrzna:
edtSizeHint=Przykłady poprawnych deklaracji rozmiaru:##1 - zmienna##[100] - tablica##[ARRAY_SIZE+1] - tablica gdzie ARRAY_SIZE jest stałą globalną typu całkowitego##[100][100] - tablica dwuwymiarowa##[ ] - nieograniczona lub dynamiczna tablica (gdy dozwolona przez język)##[ ][ ] - dwuwymiarowa nieograniczona tablica
gbVariable=Zmienna
gbConstant=Stała
InstanceVars=Zmienne Instancji
InstanceConstants=Stałe
GlobalVars=Zmienne Globalne
GlobalConsts=Stałe Globalne
GlobalDeclares=Deklaracje
ConfirmRemove=Ta operacja nie może być cofnięta. Czy na pewno chcesz kontynuować?
BadInitVal=Nieprawidłowa wartość inicjalizująca.
rgTypeBox=Rodzaj:
dtInt=Całkowity
dtReal=Rzeczywisty
dtRecord=Rekord
dtCustom=Customowy
dtEnum=Wyliczeniowy
dtOther=Inny
dtArray=Tablica
lblPrefix=Add Prefix:
gbDesc=Opis/Prefiks
chkInclDescCode=Dołącz do kodu
chkInclDescFlow=Dołącz do opisu diagramu
Flowchart=Flowchart
LngNoSprt=Język %s nie jest wspierany przez tą instancję devFlowcharter'a.
OldVerMsg=Ten projekt został stworzony w nowszej wersji (%s) devFlowcharter'a. Możliwe że nie został zaimportowany poprawnie.
EnterPage=Nazwa zakładki:
Page=Zakładka
Visible=Widoczny
chkExternal=Deklaracja zewnętrzna
chkExternal.Hint=Wyłącza z generowania kodu
ImportFunc=Import Funkcji
ImportType=Import Typów
Consts=stałe
Vars=zmienne
chkArrayType=tablica
constructor=konstruktor
DisableFieldValid=Walidacja tego pola może zostać wyłączona w Opcje->Ustawienia (sekcja Inne)
NoProgTempl=Nie można wygenerować kodu źródłowego:%sPlik definicji dla języka %s (%s) nie zawiera znacznika %s lub ten znacznik jest pusty.
CodeGenErr=Błąd podczas generowania kodu:%s%s
btnGenDesc=Generuj
OverMaxPPI=Ilość pikseli na cal dla aktualnego wyświetlacza (%d) jest powyżej maximum wspieranego przez aplikację (%d).%sDiagram oraz niektóre elementy interfejsu użytkownika mogą być wyświetlane niepoprawnie.
argHintStr=Możesz zmieniać kolejność parametrów przeciągając je myszą
fieldHintStr=Możesz zmieniać kolejność pól przeciągając je myszą
LoadTranslFail=Nie udało się załadować tłumaczenia z pliku %s.%sŁadowanie domyślnego tłumaczenia.

; Klucze poniżej (po 4 na każdy język programowania) są używane do wyświetlania informacji o funkcji na diagramie. Example jest przykładowym językiem zdefiniowanym w pliku ../LanguageDefinitions/Example.xml.
 
; Klucz ProcedureLabelExample
; Dostępne placeholdery: %s1 - nazwa procedury, %s2 - lista parametrów procedury, %s4 - opis procedury, %s6 - modyfikator dla procedur zewnętrznych, ## - nowa linia
ProcedureLabelExample=procedura %s1(%s2)##%s4

; Klucz ConstructorLabelExample 
; Dostępne placeholdery: %s1 - nazwa konstruktora, %s2 - lista parametrów, %s3 - typ tworzonego obiektu, %s4 - opis konstruktora, %s6 - modyfikator dla konstruktorów zewnętrznych, ## - nowa linia
ConstructorLabelExample=konstruktor %s6%s1(%s2)##%s4

; Klucz FunctionLabelExample 
; Dostępne placeholdery: %s1 - nazwa funkcji, %s2 - lista parametrów; %s3 - zwracany typ danych, %s4 - opis funkcji, %s5 - modyfikator dla zwracanego typu tablicowego, %s6 - modyfikator dla funkcji zewnętrznych, ## - nowa linia 
FunctionLabelExample=funkcja %s1(%s2): %s3##%s4

; Klucz ProgramLabelExample
; Dostępne placeholdery: %s1 - nazwa projektu
ProgramLabelExample=program %s1

ProcedureLabelPascal=procedura %s1(%s2)##%s4
FunctionLabelPascal=funkcja %s1(%s2): %s3##%s4
ProgramLabelPascal=Program Główny
ConstructorLabelPascal=konstruktor %s1(%s2)##%s4

ProcedureLabelC=void %s1(%s2)##%s4
FunctionLabelC=%s3%s5 %s1(%s2)##%s4
ProgramLabelC=int main

ProcedureLabelTiBasic=Prgm %s1(%s2)##%s4
FunctionLabelTiBasic=Func %s1(%s2)##%s4
ProgramLabelTiBasic=Prgm %s1

ProcedureLabelPython=funkcja %s1(%s2)##%s4
FunctionLabelPython=funkcja %s1(%s2)##%s4
ProgramLabelPython=program główny %s1

ProcedureLabelJava=%s4##%s6void %s1(%s2)
FunctionLabelJava=%s4##%s6%s3%s5 %s1(%s2)
ProgramLabelJava=void main(String[] args)
ConstructorLabelJava=%s4##konstruktor %s6 %s1(%s2)

[DeclarationsForm]
FormCaption=Deklaracje

[GotoForm]
FormCaption=Przejdź do
rbLine=Linia
rbNextBookmark=Następna zakładka
rbPrevBookmark=Poprzednia zakładka
btnGoTo=Ok

[HelpForm]
FormCaption=Edytor Kodu - Pomoc
EditorHelp1=Skróty Klawiszowe:
EditorHelp2=
EditorHelp3=Kombinacja:     Zdarzenie:
EditorHelp4=--------------------------------------------------------
EditorHelp5=Ctrl-Y          Usuń linie
EditorHelp6=Ctrl-A          Zaznacz wszystko
EditorHelp7=Ctrl-C          Kopiuj
EditorHelp8=Ctrl-X          Wytnij
EditorHelp9=Ctrl-V          Wklej
EditorHelp10=Ctrl-Z          Cofnij
EditorHelp11=Ctrl-Home       Skok do pierwszej linii
EditorHelp12=Ctrl-End        Skok do ostatniej linii
EditorHelp13=Shift-Ctrl-Z    Przywróć
EditorHelp14=Shift-Ctrl-B    Znajdź domykający nawias
EditorHelp15=Shift-Ctrl-I    Przesuń zaznaczony blok w prawo
EditorHelp16=Shift-Ctrl-U    Przesuń zaznaczony blok w lewo
EditorHelp17=Shift-Ctrl-C    Przełącz na zaznaczanie kolumn
EditorHelp18=Shift-Ctrl-L    Przełącz na zaznaczanie wierszy
EditorHelp19=Shift-Ctrl-N    Przełącz na standardowe zaznaczanie
EditorHelp20=
EditorHelp21=Wskazówki:
EditorHelp22=--------------------------------------------------------
EditorHelp23=• Aby skopiować komentarz z obszaru algorytmu do edytora
EditorHelp24="  wciśnij Shift i przeciągnij komentarz do edytora."
EditorHelp25=• Aby wygenerować kod dla pojedynczej funkcji lub typu
EditorHelp26="  danych, przeciągnij jej nazwę zakładki do edytora."
EditorHelp27=• Aby wygenerować i wkleić kod pojedynczego bloku,
EditorHelp28="  zaznacz go i przeciągnij do edytora."
EditorHelp29=• Aby zaznaczyć kod podczas przełączania funkcji/typów
EditorHelp30="  na ich formie, przytrzymaj klawisz Ctrl."
EditorHelp31=• Aby zaznaczyć/odznaczyć kod podświetlonego elementu
EditorHelp32="  algorytmu, przytrzymaj klawisz Ctrl."

[MainForm]
miFile=Plik
miProject=Projekt
miOptions=Opcje
miNew=Nowy
miOpen=Otwórz...
miReopen=Ostatnie pliki
miSave=Zapisz
miSaveAs=Zapisz jako...
miClose=Zamknij
miPrint=Drukuj...
miPrint2=Drukuj...
miExit=Zakończ
miDataTypes=Typy Danych
miSubRoutines=Funkcje
miDeclarations=Deklaracje
miExplorer=Eksplorator
miNavigator=Nawigator
miAddMain=Dodaj Główny Program
miUndoRemove=Cofnij Usuń
miGenerate=Generuj Kod
miToolbox=Toolbox
miSettings=Ustawienia
miManual=Pomoc
miAbout=O Programie
miInsert=Wstaw
miNewFlowchart=Algorytm
miNewFunction=Nowa Funkcja
miFont=Czcionka
miRemove=Usuń
miRemove.Hint=Zaznaczony blok diagramu możesz również usunąć wciskając klawisz Delete
miCut=Wytnij
miCut.Hint=Bloki diagramu możesz również wycinać/wklejać przez przeciągnij i upuść
miCopy=Kopiuj
miCopy.Hint=Bloki diagramu możesz również kopiować/wklejać przez przeciągnij i upuść, trzymając wciśnięty klawisz Shift
miInstrs=Instrukcje
miLoop=Pętle
miRoutineCall=Wywołanie Funkcji
miComment=Komentarz
miPaste=Wklej
miInstr=Instrukcja
miMultiInstr=Wielokrotne Instrukcje
miInput=Instrukcja Wejścia
miOutput=Instrukcja Wyjścia
miIf=Prosta Instrukcja Warunkowa
miIfElse=Instrukcja Warunkowa
miReturn=Instrukcja Powrotu
miReturn.Hint=Użycie możliwe tylko gdy jest ostatnią instrukcją w wyrażeniu złożonym.
miFor=Dla
miWhile=Dopóki
miRepeat=Powtarzaj
miCase=Instrukcja Wyboru
miFontStyle=Styl
miFontSize=Rozmiar
miStyleNormal=Normalny
miStyleBold=Pogrubiony
miStyleItalic=Pochyły
miStyleUnderLine=Podkreślony
miStyleStrikeOut=Przekreślony
miStyleStrikeOut.Hint=Ustawienie stylu przekreślonego wyklucza blok z generowania kodu.
miFrame=Ramka
miFrame.Hint=Gdy blok jest zaznaczony ramkę możesz przełączać klawiszem F11 lub podwójnie klikając lewy klawisz myszy
miFoldUnfold.Hint=Zaznaczony blok możesz również zwijać/rozwijać klawiszem F12
miExpandBlock=Rozwiń
miAddBranch=Dodaj Gałąź Wyboru
miRemoveBranch=Usuń Gałąź Wyboru
miInsertBranch=Wstaw Gałąź Wyboru
miUnfoldAll=Rozwiń Wszystko
miUnfoldAll.Hint=Wszystkie zwinięte bloki w zaznaczonym bloku możesz również rozwinąć klawiszem F10
miText=Tekst
miFolder=Folder
miFolder.Hint=Blok zawierający w sobie wiele bloków. Ułatwia ich wspólne przeciąganie lub kopiowanie.
SaveDialog=Pliki XML (*.xml)|*.xml;
OpenDialog=Pliki XML (*.xml)|*.xml;
miExport=Eksportuj...
miImport=Importuj...
miMemo=Memo
miMemoEdit=Edytuj Tekst
miMemoVScroll=Pionowy Suwak
miMemoHScroll=Poziomy Suwak
miMemoWordWrap=Zawijaj Tekst
miMemoAlignRight=Wyrównaj do prawej
miAddPage=Dodaj
miRemovePage=Usuń
miRenamePage=Zmień nazwę
miUndo=Cofnij
miCut1=Wytnij
miCopy1=Kopiuj
miPaste1=Wklej
miRemove1=Usuń
miInsertFunc=Wstaw Funkcję
miIsHeader=Nagłówek Programu
miPasteText=Wklej

[SettingsForm]
FormCaption=Ustawienia
gbProgLang=Język Programowania
gbTranslation=Język Aplikacji
gbParse=Analiza Składni
gbEditor=Edytor Kodu
gbEditorColors=Kolory
gbMisc=Inne
gbPrint=Drukowanie
lblCompiler=Polecenie kompilatora:
lblCompilerNoMain=Polecenie kompilatora dla projektów no-main:
lblFile=Plik translacji:
chkParseAssign=Instrukcja (przypisanie)
chkParseMultiAssign=Wielokrotne Instrukcje (przypisanie)
chkParseCondition=Wyrażenie warunkowe
chkParseFor=Pętla dla
chkParseCase=Instrukcja wyboru
chkParseOutput=Instrukcja wyjścia
chkParseInput=Instrukcja wejścia
chkParseRoutine=Wywołanie funkcji
chkParseReturn=Instrukcja powrotu
chkConfirmRemove=Potwierdzaj nieodwracalne usunięcia
lblIndent=Wcięcie:
lblEditorFont=Czcionka:
lblEditorBkg=Tło:
lblEditorActiveLine=Aktualna linia:
lblEditorGutter=Gutter:
lblEditorDigit=Liczby:
lblEditorString=Strings:
lblEditorSelect=Zaznaczenie:
lblEditorComment=Komentarze:
lblEditorIdent=Identyfikatory:
lblEditorKeyword=Słowa klucz:
lblDesktop=Pulpit:
lblSelectColor=Zaznacz:
lblFontColor=Czcionka:
lblPenColor=Pisak:
gbFlowchart=Diagram
chkEnableDBuffer.Caption=Podwójne buforowanie
chkEnableDBufferHint=Eliminuje migotanie przy rysowaniu diagramu##Wpływa negatywnie na wydajność przewijania dużych diagramów
chkShowFuncLabels=Pokazuj opisy diagramów
chkShowBlockLabels=Pokazuj opisy bloków
btnDefault=Ustawienia Domyślne
btnBrowseCompilers=Przeglądaj...
btnBrowseTranslations=Przeglądaj...
btnSave=OK
btnDiscard=Anuluj
chkMultiPrint=Drukuj na wielu stronach
chkMultiPrintHorz=Drukuj na wielu stronach w poziomie
gbPrintMargins=Marginesy (w procentach)
lblMarginLeft=Lewy:
lblMarginRight=Prawy:
lblMarginTop=Górny:
lblMarginBottom=Dolny:
edtCompilerHint=Dostępne sekwencje:##%s1 - nazwa zapisanego pliku źródłowego##%s2 - nazwa zapisanego pliku źródłowego bez rozszerzenia##Przykładowe polecenie:##cmd.exe /k C:\SomeCompiler\bin\compile.bat "%s1"
edtCompilerNoMainHint=Dostępne sekwencje:##%s1 - nazwa zapisanego pliku źródłowego##%s2 - nazwa zapisanego pliku źródłowego bez rozszerzenia##%s3 - standardowe polecenie kompilatora
chkValidateConsts=Włącz dodatkową walidację dla deklaracji
chkAutoUpdateCode=Auto-aktualizacja kodu dla zmian w projekcie
lblFontSize=Rozmiar czcionki:
pnlFont.Hint=Nie może być ani czerwony ani oliwkowy
pnlSelect.Hint=Musi być inny niż kolor pulpitu
lblFileEncoding=Kodowanie plików:
edtFontNameSize=nazwa czcionki : rozmiar czcionki
cbIndentChar.0=spacja
cbIndentChar.1=tab

[EditorForm]
FormCaption=Edytor Kodu
miProgram=Program
miSave=Zapisz...
miCompile=Kompiluj...
miRun=Uruchom
miPrint=Drukuj...
miEdit=Edycja
miFind=Znajdź...
miReplace=Zamień...
miGoto=Przejdź do...
miView=Widok
miStatusBar=Pasek Stanu
miScrollbars=Suwaki
miGutter=Gutter
miCodeFolding=Zwijanie Kodu
miCodeFoldingEnable=Włącz
miCollapseAll=Zwiń Wszystko
miUnCollapseAll=Rozwiń Wszystko
miIndentGuides=Wskaźnik Wcięcia
miRichText=Podświetlaj Kod
miRegenerate=Regeneruj
miRegenerate.Hint=Regeneruje kod, zachowując zmiany dodane przez użytkownika
miRegenerateFromScratch=Regeneruj od nowa
miRegenerateFromScratch.Hint=Regeneruje kod, odrzucając zmiany dodane przez użytkownika  
miHelp=Pomoc
miUndo=Cofnij
miRedo=Przywróć
miCut=Wytnij
miCopy=Kopiuj
miCopyRichText=Kopiuj Specjalnie
miPaste=Wklej
miPasteComment=Wklej jako Komentarz
miRemove=Usuń
miSelectAll=Zaznacz Wszystko
Modified=Zmodyfikowany
InsertMode=
OverwriteMode=Nadpisywanie
miFindProj=Znajdź w Projekcie
miFindProj.Hint=Znajdź w Projekcie działa z zaznaczaniem tekstu i pozycją kursora

[DataTypesForm]
FormCaption=Typy Danych
miAction=Typ Danych
miAdd=Dodaj
miRemove=Usuń
miRemoveAll=Usuń Wszystko
miImport=Importuj...
miExport=Eksportuj...
miExportAll=Eksportuj Wszystko...

[FunctionsForm]
FormCaption=Funkcje
miAction=Funkcja
miAdd=Dodaj
miRemove=Usuń
miRemoveAll=Usuń Wszystko
miImport=Importuj...
miExport=Eksportuj...
miExportAll=Eksportuj Wszystko...

[ExplorerForm]
FormCaption=Eksplorator
miNextError=Następny błąd/ostrzeżenie
miPrevError=Poprzedni błąd/ostrzeżenie
miExpand=Rozwiń wszystko
miCollapse=Zwiń wszystko
miRemove=Usuń
miRefresh=Odśwież
miRebuild=Przebuduj
chkAutoNav=Włącz auto-nawigację

[ToolBoxForm]
FormCaption=ToolBox
sbInstr=Instrukcja
sbMultiInstr=Wielokrotne Instrukcje
sbIf=Prosta Instrukcja Warunkowa
sbIfElse=Instrukcja Warunkowa
sbInput=Instrukcja Wejścia
sbOutput=Instrukcja Wyjścia
sbFor=Dla
sbRepeat=Powtarzaj
sbWhile=Dopóki
sbFuncCall=Wywołanie Funkcji
sbCase=Instrukcja Wyboru
sbReturn=Instrukcja Powrotu
sbFolder=Folder
sbText=Tekst

[NavigatorForm]
FormCaption=Nawigator

[AboutForm]
FormCaption=O Programie

[MemoEditorForm]
FormCaption=Edytor Memo
btnOK=OK
btnCancel=Anuluj

[SelectImportForm]
btnOK=OK
btnCancel=Anuluj
chkSelectAll=Zaznacz Wszystko